Autodesk.Revit.DB.BRepBuilderState
This class defines an enumerative type used to specify the state of a BRepBuilder object.
Since:
2017
This enumerative type corresponds to the possible states of a BRepBuilder object.
Since:
2017

Autodesk.Revit.DB.BRepBuilderState.Completed
Finish() successfully created a valid Geometry object. No new data may be added.The built object may be retrieved via GetResult().

Autodesk.Revit.DB.BRepBuilderState.AcceptingData
BRepBuilder is accumulating data. New b-rep components such as edges or faces may be added.

Autodesk.Revit.DB.BRepBuilderState.InvalidState
BRepBuilder is in an invalid state. No further productive use is possible.